-- ----------------------------
-- Records of t_user
-- ----------------------------
INSERT INTO `t_user` VALUES ('1', 'admin', 'admin');
INSERT INTO `t_user` VALUES ('2', 'user', 'user');

-- ----------------------------
-- Records of t_publisher
-- ----------------------------
INSERT INTO `t_publisher` VALUES ('1', '机械工业出版社', '13812345678', '张三', '经典出版社');
INSERT INTO `t_publisher` VALUES ('2', '电子工业出版社', '13012345678', '李四', '一般口水书出版社');
INSERT INTO `t_publisher` VALUES ('3', '清华大学出版社', '16888888888', '王五', '老牌大学出版社');

-- ----------------------------
-- Records of t_book_type
-- ----------------------------
INSERT INTO `t_book_type` VALUES ('1', '开发', '开发工程师使用、参考书籍');
INSERT INTO `t_book_type` VALUES ('2', '测试', '测试方面的图书');

-- ----------------------------
-- Records of t_book
-- ----------------------------
INSERT INTO `t_book` VALUES ('1', 'Java程序设计与计算思维', '程序设计的过程就是一种计算思维的表现，本书结合Java程序设计语言的教学特点，遵循计算思维的方式，图解重要概念，通过大量的范例程序讲解和上机编程实践来指导读者活用Java程序语法，兼顾培养计算思维和学习面向对象程序设计的双目标。', '70', '1', '1', 'upload/e56c371e-e31b-4686-a78f-38d8470f4021.jpg', '赵军', '0');
INSERT INTO `t_book` VALUES ('2', '微服务架构设计模式', '涵盖44个架构设计模式，系统解决服务拆分、事务管理、查询和跨服务通信等难题', '100', '1', '1', 'upload/03499c25-8d21-469d-8e17-5e56c8867476.jpg', '[美]克里斯·理查森', '0');
INSERT INTO `t_book` VALUES ('3', '软件测试（原书第2版）', '本书涵盖了软件测试的方方面面:软件测试如何适应软件开发过程，基本的和高级的软件测试技术，在常见的测试任务中运用测试技能，使用自动化提高测试的效率，测试工作的计划和文档化，有效地报告发现的问题，衡量测试工作的成效和产品的改进，\n测试和质量保证的区别，寻求软件测试员的工作。', '41', '1', '2', 'upload/56221c9a-0c90-4b37-8ca0-ff3080505076.jpg', '[美]罗恩·佩腾', '0');
INSERT INTO `t_book` VALUES ('4', 'MongoDB从入门到商业实战', '从零学MongoDB，并希望可以在企业中真正应用的读者', '89', '2', '1', 'upload/de9d5318-123d-4e96-9c1e-28c70f7e7483.jpg', '张雯杰', '0');



